/*

   calin/iact_data/nectarcam_acada_event_decoder_r1v0.cpp -- Stephen Fegan -- 2018-09-21

   A decoder of NectarCAM ACADA data in prototype R1 format

   Copyright 2016, Stephen Fegan <sfegan@llr.in2p3.fr>
   Laboratoire Leprince-Ringuet, CNRS/IN2P3, Ecole Polytechnique, Institut Polytechnique de Paris

   This file is part of "calin"

   "calin" is free software: you can redistribute it and/or modify it
   under the terms of the GNU General Public License version 2 or
   later, as published by the Free Software Foundation.

   "calin" is distributed in the hope that it will be useful, but
   WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
   General Public License for more details.

*/

#include <stdexcept>
#include <string>
#include <memory>
#include <numeric>

#include <util/log.hpp>
#include <util/file.hpp>
#include <iact_data/acada_data_source.hpp>
#include <iact_data/nectarcam_acada_event_decoder.hpp>
#include <iact_data/nectarcam_layout.hpp>
#include <iact_data/nectarcam_configuration.hpp>
#include <provenance/system_info.hpp>

using namespace calin::iact_data::acada_data_source;
using namespace calin::iact_data::nectarcam_acada_event_decoder;
using namespace calin::ix::iact_data::telescope_event;
using namespace calin::ix::iact_data::telescope_run_configuration;
using namespace calin::util::log;

#define TEST_ANYARRAY_TYPES 0

/*


        "Module status array size does not match number of nodukes.");
    const auto* mod_status =
      reinterpret_cast<const uint8_t*>(&cta_status.data().front());
    for(unsigned imod=0, mod_index=0;imod<nmod_;imod++)
    {
      if(*(mod_status++)&0x01)
      {
        calin_event->add_module_index(mod_index);
        calin_event->add_module_id(imod);
        mod_index++;
      }
      else
      {
        calin_event->add_module_index(-1);
        all_modules_present = false;
      }
    }
  }
  else
  {
    throw(std::runtime_error("NectarCam_ACADACameraEventDecoder_R1v0::decode: "
      "ACADA event does not have NectarCAM module_status"));
  }
  calin_event->set_all_modules_present(all_modules_present);

  // ==========================================================================
  //
  // TRANSFER IMAGE DATA
  //
  // ==========================================================================

  if(cta_event->has_waveform() and cta_event->has_pixel_status())
  {
    const unsigned npix = nmod_*7;
    unsigned single_gain_dataset_size = npix*nsample_*sizeof(int16_t);
    if(cta_event->pixel_status().data().size() != npix)
      throw(std::runtime_error("NectarCam_ACADACameraEventDecoder_R1v0::decode: "
        "Pixel status array incorrect size: "
        + std::to_string(cta_event->pixel_status().data().size())
        + ", expected: " + std::to_string(npix)));

    const uint8_t* pix_status =
      reinterpret_cast<const uint8_t*>(cta_event->pixel_status().data().data());
    const int16_t* waveforms =
      reinterpret_cast<const int16_t*>(cta_event->waveform().data().data());

    if(cta_event->waveform().data().size() == 2*single_gain_dataset_size) {
      copy_single_gain_waveforms(calin_event, waveforms, pix_status,
        calin_event->mutable_high_gain_image()->mutable_camera_waveforms(),
        0x04, "high");
      copy_single_gain_waveforms(calin_event, waveforms+npix*nsample_, pix_status,
        calin_event->mutable_low_gain_image()->mutable_camera_waveforms(),
        0x08, "low");
    } else if(cta_event->waveform().data().size() == single_gain_dataset_size) {
      copy_single_gain_waveforms(calin_event, waveforms, pix_status,
        calin_event->mutable_image()->mutable_camera_waveforms(),
        0x0C, "mixed");
    } else {
      throw(std::runtime_error("NectarCam_ACADACameraEventDecoder_R1v0::decode: "
        "Samples array incorrect size: "
        + std::to_string(cta_event->waveform().data().size())
        + ", expected: " + std::to_string(2*single_gain_dataset_size)
        + " (dual gain mode) or " + std::to_string(single_gain_dataset_size)
        + " (mixed gain)"));
    }
  }

  // ==========================================================================
  //
  // DECODE NECTARCAM COUNTERS
  //
  // ==========================================================================

  uint64_t mod_clock_sum = 0;
  uint64_t mod_clock_seq_sum = 0;
  int64_t mod_clock_num = 0;
  bool mod_clock_is_suspect = false;

  if(cta_event->nectarcam().has_counters())
  {
    struct NectarCounters {
      /*  4 */ uint32_t global_event_counter;
      /*  6 */ uint16_t bunch_counter;
      /*  8 */ uint16_t event_counter;
      /* 12 */ uint32_t ts1;
      /* 13 */ int8_t   ts2_event;
      /* 14 */ int8_t   ts2_bunch;
      /* 16 */ uint16_t ts2_empty;
    }__attribute__((packed));

    struct NectarCountersWithTriggerPattern {
      /*  4 */ uint32_t global_event_counter;
      /*  6 */ uint16_t bunch_counter;
      /*  8 */ uint16_t event_counter;
      /* 12 */ uint32_t ts1;
      /* 13 */ int8_t   ts2_event;
      /* 14 */ int8_t   ts2_bunch;
      /* 16 */ uint16_t ts2_empty;
      /* 20 */ uint32_t trigger_pattern;
    }__attribute__((packed));

    const auto& cta_counters = cta_event->nectarcam().counters();
#if TEST_ANYARRAY_TYPES
    if(cta_counters.type() != DataModel::AnyArray::U16)
      throw std::runtime_error("Camera counters type not U16");
#endif

    calin::ix::iact_data::telescope_event::ChannelTriggerMap* trigger_map = nullptr;
    unsigned data_size = sizeof(NectarCounters);
    unsigned data_version = 0;
    if(cta_counters.data().size() != nmod_ * data_size) {
      data_size = sizeof(NectarCountersWithTriggerPattern);
      data_version = 1;
      if(cta_counters.data().size() != nmod_ * data_size) {
        throw std::runtime_error("Camera counters data array correct size. "
          "Expected " + std::to_string(nmod_*sizeof(NectarCounters)) + " or " +
          std::to_string(nmod_*sizeof(NectarCountersWithTriggerPattern)) +
          ", got " + std::to_string(cta_counters.data().size()));
      }

